
# 느낀점

실습 시간에 진도를 한번 놓쳐 전반적인 이해도가 부족한 채로 과제를 시작했는데, 덕분에 과제 수행이 상당히 어려웠다. 세션과 리퀘스트 객체의 차이점부터 시작해서 DB 연결, 자료 접근까지 모르는 것 투성이였으나 Gitlab에서 다운받은 자료와 AI, 인터넷 자료 조사를 통해 어느정도 과제 수행이 가능한 단계까지 올라올 수는 있었다.

일단 과제가 진행되며 서블릿 마다 각각의 기능을 명확히 분리해야 한다는 것을 느꼈고, 각각의 서블릿마다 정보를 교환하는 부분을 확실하게 해야 한다는 것을 느꼈다. 오탈자나 언더바 하나 등의 차이로 인해 프로그램이 제대로 동작하지 않을 수도 있고. 리퀘스트 객체와 세션 객체를 용도에 따라 적절히 사용해야 한다는 것을 알았다. 특히 이번 과제를 수행하면서 jsp파일로 포워딩할 경우 리퀘스트 객체만 사용하는게 더 낫다는 것을, 서블릿으로 포워딩할 경우 세션 객체를 사용하는게 더 낫다는 것을 알았다. 당연히 경우에 따라 다르겠지만 이번 과제에서만큼은 그렇게 느낄 수 있었다.

아직 더 공부해야 할 점이 많은데, 특히 DAOImpl 부분이 어떤 방식으로 동작하는지, 그리고 중도 참여 세션을 어떻게 걸러내야 하는지를 더 알아봐야겠다고 생각했다. 실습 과제를 참고하여 해당 프로그램을 완성했기에 아직 어떤 방식으로 동작하는지, 그리고 현재 과제에 사용된 코드가 효율적인지, 문제가 없는지 알 수가 없었다. 이후 학기말 프로젝트 과제를 본격적으로 작업하기 이전에 반드시 익혀야겠다고 생각 중이다.
